# Creating, Altering, and Dropping a Table

## Defining the Database Schema
You can start by creating a database schema for an online movie rating system. The database will consist of three tables:

1. movies contains general information about movies and has the following attributes:
- id
- title
- release_year
- genre
- collection_in_mil
2. reviewers contains information about people who posted reviews or ratings and has the following attributes:
- id
- first_name
- last_name
3. ratings contains information about ratings that have been posted and has the following attributes:
- movie_id (foreign key)
- reviewer_id (foreign key)
- rating

### Overview of schema

![schema](schema.webp)

## Creating Tables Using the CREATE TABLE Statement

The sql

```
CREATE TABLE movies(
    id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(100),
    release_year YEAR(4),
    genre VARCHAR(100),
    collection_in_mil INT
);
```

If you’ve looked at SQL statements before, then most of the above query might make sense. But there are some differences in the MySQL syntax that you should be aware of.

For example, MySQL has a wide variety of data types for your perusal, including YEAR, INT, BIGINT, and so on. Also, MySQL uses the AUTO_INCREMENT keyword when a column value has to be incremented automatically on the insertion of new records.

To create a new table, you need to pass this query to cursor.execute(), which accepts a MySQL query and executes the query on the connected MySQL database:

In [1]:
# Setup connection

from mysql.connector import connect, Error
import os
from dotenv import load_dotenv
load_dotenv()

server = os.getenv("mySQL_SERVER_NAME") # mySQL_SERVER_NAME
database = os.getenv("mySQL_DATABASE") # mySQL_DATABASE
username = os.getenv("mySQL_USER_NAME") # mySQL_USER_NAME
myPassword = os.getenv("mySQL_PASSWORD") # mySQL_PASSWORD

#### Create movies table

In [4]:
try:
    with connect(
        host=server,
        user=username,
        password=myPassword,
        database="online_movie_rating",
    ) as connection:
        # Inject the SQL
        create_movies_table_query = """
        CREATE TABLE movies(
            id INT AUTO_INCREMENT PRIMARY KEY,
            title VARCHAR(100),
            release_year YEAR(4),
            genre VARCHAR(100),
            collection_in_mil INT
        )
        """
        with connection.cursor() as cursor:
            cursor.execute(create_movies_table_query)
            connection.commit()
except Error as e:
    print(e)

#### Create reviewers table

In [6]:
try:
    with connect(
        host=server,
        user=username,
        password=myPassword,
        database="online_movie_rating",
    ) as connection:
        # Inject the SQL
        create_reviewers_table_query = """
        CREATE TABLE reviewers (
            id INT AUTO_INCREMENT PRIMARY KEY,
            first_name VARCHAR(100),
            last_name VARCHAR(100)
        )
        """
        with connection.cursor() as cursor:
            cursor.execute(create_reviewers_table_query)
            connection.commit()
except Error as e:
    print(e)

#### Create ratings table

In [7]:
try:
    with connect(
        host=server,
        user=username,
        password=myPassword,
        database="online_movie_rating",
    ) as connection:
        # Inject the SQL
        create_ratings_table_query = """
        CREATE TABLE ratings (
            movie_id INT,
            reviewer_id INT,
            rating DECIMAL(2,1),
            FOREIGN KEY(movie_id) REFERENCES movies(id),
            FOREIGN KEY(reviewer_id) REFERENCES reviewers(id),
            PRIMARY KEY(movie_id, reviewer_id)
        )
        """
        with connection.cursor() as cursor:
            cursor.execute(create_ratings_table_query)
            connection.commit()
except Error as e:
    print(e)

### Showing a Table Schema Using the DESCRIBE Statemen

To get some results back from the cursor object, you need to use ```cursor.fetchall()```

In [8]:
# SQL => DESCRIBE <table_name>;

In [9]:
try:
    with connect(
        host=server,
        user=username,
        password=myPassword,
        database="online_movie_rating",
    ) as connection:
        show_table_query = "DESCRIBE movies"
        with connection.cursor() as cursor:
            cursor.execute(show_table_query)
            # Fetch rows from last executed query
            result = cursor.fetchall()
            for row in result:
                print(row)
except Error as e:
    print(e)

('id', b'int', 'NO', 'PRI', None, 'auto_increment')
('title', b'varchar(100)', 'YES', '', None, '')
('release_year', b'year', 'YES', '', None, '')
('genre', b'varchar(100)', 'YES', '', None, '')
('collection_in_mil', b'int', 'YES', '', None, '')

### Modifying a Table Schema Using the ALTER Statement

In the movies table, you have a column called collection_in_mil, which contains a movie’s box office collection in millions of dollars. You can write the following MySQL statement to modify the data type of collection_in_mil attribute from INT to DECIMAL:

```ALTER TABLE movies MODIFY COLUMN collection_in_mil DECIMAL(4,1);```

In [10]:
try:
    with connect(
        host=server,
        user=username,
        password=myPassword,
        database="online_movie_rating",
    ) as connection:
        alter_table_query = """
        ALTER TABLE movies
        MODIFY COLUMN collection_in_mil DECIMAL(4,1)
        """
        show_table_query = "DESCRIBE movies"
        with connection.cursor() as cursor:
            cursor.execute(alter_table_query)
            cursor.execute(show_table_query)
            # Fetch rows from last executed query
            result = cursor.fetchall()
            print("Movie Table Schema after alteration:")
            for row in result:
                print(row)
except Error as e:
    print(e)

Movie Table Schema after alteration:
('id', b'int', 'NO', 'PRI', None, 'auto_increment')
('title', b'varchar(100)', 'YES', '', None, '')
('release_year', b'year', 'YES', '', None, '')
('genre', b'varchar(100)', 'YES', '', None, '')
('collection_in_mil', b'decimal(4,1)', 'YES', '', None, '')

### Deleting Tables Using the DROP Statement
To delete a table, you need to execute the DROP TABLE statement in MySQL. Deleting a table is an irreversible process. If you execute the code below, then you’ll ```need to call the CREATE TABLE query again to use the ratings table in the upcoming sections.```

In [ ]:
try:
    with connect(
        host=server,
        user=username,
        password=myPassword,
        database="online_movie_rating",
    ) as connection:
        drop_table_query = "DROP TABLE ratings"
        with connection.cursor() as cursor:
            cursor.execute(drop_table_query)
except Error as e:
    print(e)